<a href="https://colab.research.google.com/github/TheMLEngineer/Data-Analysis-Book-wes-mckinney-/blob/master/Chapter_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows

In [158]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.913436 -1.290859
1    a  two -1.041078 -0.805773
2    b  one  0.265528  0.506175
3    b  two  0.068703 -1.021270
4    a  one -1.522326  1.413432

In [159]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [160]:
grouped.mean()

key1
a   -0.549989
b    0.167115
Name: data1, dtype: float64

In [161]:
means = df['data1'].groupby([df['key1'] , 
                             df['key2']]).mean()

means

key1  key2
a     one    -0.304445
      two    -1.041078
b     one     0.265528
      two     0.068703
Name: data1, dtype: float64

In [162]:
means.unstack()

key2       one       two
key1
a    -0.304445 -1.041078
b     0.265528  0.068703

In [0]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [164]:
df.data1

0    0.913436
1   -1.041078
2    0.265528
3    0.068703
4   -1.522326
Name: data1, dtype: float64

In [165]:
df.data1.groupby([states , years]).mean()

California  2005   -1.041078
            2006    0.265528
Ohio        2005    0.491070
            2006   -1.522326
Name: data1, dtype: float64

In [166]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.549989 -0.227734
b     0.167115 -0.257547

In [167]:
df.groupby(['key1' , 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.304445  0.061286
     two  -1.041078 -0.805773
b    one   0.265528  0.506175
     two   0.068703 -1.021270

In [168]:
df.groupby(['key1' , 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [169]:
for name , group in df.groupby('key1'):
  print('*'*20)
  print(name)
  print('*'*20)
  print(group)

********************
a
********************
  key1 key2     data1     data2
0    a  one  0.913436 -1.290859
1    a  two -1.041078 -0.805773
4    a  one -1.522326  1.413432
********************
b
********************
  key1 key2     data1     data2
2    b  one  0.265528  0.506175
3    b  two  0.068703 -1.021270

In [170]:
for (k1 , k2) , group in df.groupby(['key1' , 'key2']):
  print('*'*20)
  print((k1 , k2))
  print('*'*20)
  print(group)

********************
('a', 'one')
********************
  key1 key2     data1     data2
0    a  one  0.913436 -1.290859
4    a  one -1.522326  1.413432
********************
('a', 'two')
********************
  key1 key2     data1     data2
1    a  two -1.041078 -0.805773
********************
('b', 'one')
********************
  key1 key2     data1     data2
2    b  one  0.265528  0.506175
********************
('b', 'two')
********************
  key1 key2     data1    data2
3    b  two  0.068703 -1.02127

In [171]:
pieces = dict(list(
    df.groupby('key1')
))

pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.913436 -1.290859
 1    a  two -1.041078 -0.805773
 4    a  one -1.522326  1.413432, 'b':   key1 key2     data1     data2
 2    b  one  0.265528  0.506175
 3    b  two  0.068703 -1.021270}

In [172]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.265528  0.506175
3    b  two  0.068703 -1.021270

In [173]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [174]:
grouped = df.groupby(
    df.dtypes , axis = 1
)

grouped

In [175]:
for dtype , group in grouped:
  print('*'*20)
  print(dtype)
  print('*'*20)
  print(group)

********************
float64
********************
      data1     data2
0  0.913436 -1.290859
1 -1.041078 -0.805773
2  0.265528  0.506175
3  0.068703 -1.021270
4 -1.522326  1.413432
********************
object
********************
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [176]:
df.groupby('key1')['data1']

In [177]:
df['data1'].groupby(df['key1'])

In [0]:
# Both above are same

In [179]:
df.groupby(['key1' , 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.061286
     two  -0.805773
b    one   0.506175
     two  -1.021270

In [180]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [181]:
s_grouped.mean()

key1  key2
a     one     0.061286
      two    -0.805773
b     one     0.506175
      two    -1.021270
Name: data2, dtype: float64

In [0]:
# Grouping with Dicts and Series

In [183]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe     0.084300  1.142791  0.317148 -0.168546  2.103579
Steve  -0.807850  0.729942  0.481107 -1.370521 -1.009927
Wes     0.949000       NaN       NaN -1.018601  1.610538
Jim     1.944711  0.631946  0.197877  0.325882 -0.757986
Travis -0.350783 -0.577017  1.258501 -0.216450 -0.757269

In [0]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [185]:
by_column = people.groupby(mapping , axis = 1)
by_column

In [186]:
by_column.sum()

            blue       red
Joe     0.148602  3.330670
Steve  -0.889413 -1.087835
Wes    -1.018601  2.559538
Jim     0.523759  1.818671
Travis  1.042051 -1.685069

In [187]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [188]:
people.groupby(map_series , 
               axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [0]:
# Grouping With Functions

In [190]:
# Group by length of names of people df
people.groupby(len).sum()

          a         b         c         d         e
3  2.978011  1.774737  0.515025 -0.861265  2.956131
5 -0.807850  0.729942  0.481107 -1.370521 -1.009927
6 -0.350783 -0.577017  1.258501 -0.216450 -0.757269

In [0]:
  key_list = ['one', 'one', 'one', 'two', 'two']

In [192]:
people.groupby([len , key_list] , axis = 1).min()

               1
             one       two
Joe     0.084300 -0.168546
Steve  -0.807850 -1.370521
Wes     0.949000 -1.018601
Jim     0.197877 -0.757986
Travis -0.577017 -0.757269

In [0]:
# Grouping by index levels

In [194]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
display(columns)
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

cty          US                            JP
tenor         1         3         5         1         3
0     -0.304688  0.031555 -0.990538  1.448064 -0.603504
1      0.072322  0.952974  1.624356  0.784891 -0.335522
2     -0.876425  1.244587  0.342525  0.018148  0.470109
3     -1.645969  0.083939 -0.607826  2.036925 -0.002431

In [195]:
hier_df.groupby(level='cty' , axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [0]:
# Data Aggregation

In [197]:
df

  key1 key2     data1     data2
0    a  one  0.913436 -1.290859
1    a  two -1.041078 -0.805773
2    b  one  0.265528  0.506175
3    b  two  0.068703 -1.021270
4    a  one -1.522326  1.413432

In [198]:
grouped = df.groupby('key1')
grouped

In [199]:
grouped['data1']

In [200]:
grouped['data1'].quantile(0.9)

key1
a    0.522533
b    0.245845
Name: data1, dtype: float64

In [0]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [202]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.435763  2.704291
b     0.196824  1.527446

In [203]:
grouped.describe()

     data1                      ...     data2
     count      mean       std  ...       50%       75%       max
key1                            ...
a      3.0 -0.549989  1.290004  ... -0.805773  0.303829  1.413432
b      2.0  0.167115  0.139176  ... -0.257547  0.124314  0.506175

[2 rows x 16 columns]

In [0]:
# Column-Wise and Multiple Function Application

In [0]:
tips = pd.read_csv('https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/tips.csv')

In [206]:
tips.head(6)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4

In [0]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [208]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [209]:
grouped = tips.groupby(['day' , 'smoker'])
grouped

In [210]:
grouped_pct = grouped['tip_pct']
grouped_pct

In [211]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [212]:
grouped_pct.agg(['mean' , 'var' , 'std' , 'first' , 'last'])

                 mean       var       std     first      last
day  smoker
Fri  No      0.151650  0.000791  0.028123  0.155625  0.187735
     Yes     0.174783  0.002631  0.051293  0.103555  0.198216
Sat  No      0.158048  0.001581  0.039767  0.162228  0.098204
     Yes     0.147906  0.003767  0.061375  0.078927  0.088222
Sun  No      0.160113  0.001793  0.042347  0.059447  0.241663
     Yes     0.187250  0.023757  0.154134  0.171331  0.095602
Thur No      0.160298  0.001503  0.038774  0.147059  0.159744
     Yes     0.163863  0.001551  0.039389  0.154321  0.196114

In [0]:
# First --> FIrst occurance of a Not Null value
# Last --> Last occurance of a value which is not null

In [214]:
grouped_pct.agg([('column_1' , 'mean') , ('column_2' , 'var')])

             column_1  column_2
day  smoker
Fri  No      0.151650  0.000791
     Yes     0.174783  0.002631
Sat  No      0.158048  0.001581
     Yes     0.147906  0.003767
Sun  No      0.160113  0.001793
     Yes     0.187250  0.023757
Thur No      0.160298  0.001503
     Yes     0.163863  0.001551

In [215]:
result = grouped['tip_pct' , 'total_bill'].agg(['count' , 'mean', 'max'])
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [216]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [217]:
# To get custom column names
grouped['tip_pct' , 'total_bill'].agg([('custom_column_name_count' , 'count') , ('custom_column_name_mean' , 'mean'), ('custom_column_name_max' , 'max')])

                             tip_pct  ...             total_bill
            custom_column_name_count  ... custom_column_name_max
day  smoker                           ...
Fri  No                            4  ...                  22.75
     Yes                          15  ...                  40.17
Sat  No                           45  ...                  48.33
     Yes                          42  ...                  50.81
Sun  No                           57  ...                  48.17
     Yes                          19  ...                  45.35
Thur No                           45  ...                  41.19
     Yes                          17  ...                  43.11

[8 rows x 6 columns]

In [218]:
# TO apply potentially different functions to one or more columns

grouped.agg(
    {'tip' : [np.max , np.min] , 
     'size' : 'sum'}
)

               tip       size
              amax  amin  sum
day  smoker
Fri  No       3.50  1.50    9
     Yes      4.73  1.00   31
Sat  No       9.00  1.00  115
     Yes     10.00  1.00  104
Sun  No       6.00  1.01  167
     Yes      6.50  1.50   49
Thur No       6.70  1.25  112
     Yes      5.00  2.00   40

In [0]:
# Returning Aggregated Data Without Row Indexes

In [220]:
# TO apply potentially different functions to one or more columns

grouped.agg(
    {'tip' : [np.max , np.min] , 
     'size' : 'sum'}
)

               tip       size
              amax  amin  sum
day  smoker
Fri  No       3.50  1.50    9
     Yes      4.73  1.00   31
Sat  No       9.00  1.00  115
     Yes     10.00  1.00  104
Sun  No       6.00  1.01  167
     Yes      6.50  1.50   49
Thur No       6.70  1.25  112
     Yes      5.00  2.00   40

In [221]:
tips.groupby(['day' , 'smoker'])

In [222]:
tips.groupby(['day' , 'smoker']).mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

In [223]:
tips.groupby(['day' , 'smoker'] , as_index= False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [0]:
# Apply: General split-apply-combine

In [0]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [225]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [226]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [227]:
tips.groupby(['smoker' , 'day']).apply(top , n =  1 , column = 'total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [228]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

        count      mean       std  ...       50%       75%       max
smoker                             ...
No      151.0  0.159328  0.039910  ...  0.155625  0.185014  0.291990
Yes      93.0  0.163196  0.085119  ...  0.153846  0.195059  0.710345

[2 rows x 8 columns]

In [229]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [0]:
f = lambda x : x.describe()

In [231]:
grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

In [232]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [233]:
tips.groupby('smoker' , group_keys= False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [0]:
# Quantile and Bucket Analysis

In [235]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
frame

        data1     data2
0    0.624920 -2.225424
1    0.727046 -0.743849
2   -0.026908  0.241282
3    0.516730 -0.265529
4    1.067935  0.014113
..        ...       ...
995  2.474869  0.160387
996  0.391008 -0.086020
997  0.311229  0.187728
998 -0.885576  0.575139
999  1.547098 -0.820898

[1000 rows x 2 columns]

In [0]:
quartile = pd.cut(frame.data1 , 4)

In [237]:
quartile

0       (0.128, 1.663]
1       (0.128, 1.663]
2      (-1.407, 0.128]
3       (0.128, 1.663]
4       (0.128, 1.663]
            ...
995     (1.663, 3.197]
996     (0.128, 1.663]
997     (0.128, 1.663]
998    (-1.407, 0.128]
999     (0.128, 1.663]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-2.948, -1.407] < (-1.407, 0.128] < (0.128, 1.663] <
                                    (1.663, 3.197]]

In [238]:
quartile[:10]

0     (0.128, 1.663]
1     (0.128, 1.663]
2    (-1.407, 0.128]
3     (0.128, 1.663]
4     (0.128, 1.663]
5     (0.128, 1.663]
6     (0.128, 1.663]
7    (-1.407, 0.128]
8    (-1.407, 0.128]
9     (0.128, 1.663]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.948, -1.407] < (-1.407, 0.128] < (0.128, 1.663] <
                                    (1.663, 3.197]]

In [239]:
df

  key1 key2     data1     data2
0    a  one  0.913436 -1.290859
1    a  two -1.041078 -0.805773
2    b  one  0.265528  0.506175
3    b  two  0.068703 -1.021270
4    a  one -1.522326  1.413432

In [0]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [0]:
grouped = frame.data2.groupby(quartile)

In [242]:
grouped

In [243]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-2.948, -1.407] -2.520714  2.197245   69.0 -0.045621
(-1.407, 0.128]  -3.539495  3.059378  466.0 -0.037338
(0.128, 1.663]   -2.624697  3.090753  400.0  0.008821
(1.663, 3.197]   -1.931277  2.284095   65.0  0.205527

In [244]:
grouping = pd.qcut(frame.data1 , 10 , labels= False)
grouping

0      7
1      7
2      4
3      6
4      8
      ..
995    9
996    6
997    6
998    1
999    9
Name: data1, Length: 1000, dtype: int64

In [245]:
grouped = frame.data2.groupby(grouping)
grouped

In [246]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.520714  3.059378  100.0  0.112464
1     -2.107381  2.709619  100.0 -0.063745
2     -3.539495  1.484017  100.0 -0.234779
3     -3.038858  2.571783  100.0  0.032686
4     -2.087742  1.731643  100.0 -0.053094
5     -2.302188  2.789570  100.0  0.002959
6     -2.449673  2.700476  100.0  0.112624
7     -2.317515  2.582084  100.0 -0.106936
8     -2.624697  3.090753  100.0 -0.112310
9     -1.931277  2.284095  100.0  0.273536

In [247]:
grouped.apply(get_stats)

data1
0      min       -2.520714
       max        3.059378
       count    100.000000
       mean       0.112464
1      min       -2.107381
       max        2.709619
       count    100.000000
       mean      -0.063745
2      min       -3.539495
       max        1.484017
       count    100.000000
       mean      -0.234779
3      min       -3.038858
       max        2.571783
       count    100.000000
       mean       0.032686
4      min       -2.087742
       max        1.731643
       count    100.000000
       mean      -0.053094
5      min       -2.302188
       max        2.789570
       count    100.000000
       mean       0.002959
6      min       -2.449673
       max        2.700476
       count    100.000000
       mean       0.112624
7      min       -2.317515
       max        2.582084
       count    100.000000
       mean      -0.106936
8      min       -2.624697
       max        3.090753
       count    100.000000
       mean      -0.112310
9      min       -1.931277
       max        2.284095
       count    100.000000
       mean       0.273536
Name: data2, dtype: float64

# Example: Filling Missing Values with Group-Specific Values

In [248]:
s = pd.Series(np.random.randn(6))
s

0   -0.687471
1    0.314583
2   -0.292497
3    0.974285
4   -0.705031
5    1.895233
dtype: float64

In [0]:
s[::2] = np.nan

In [250]:
s

0         NaN
1    0.314583
2         NaN
3    0.974285
4         NaN
5    1.895233
dtype: float64

In [251]:
s.fillna(s.mean())

0    1.061367
1    0.314583
2    1.061367
3    0.974285
4    1.061367
5    1.895233
dtype: float64

In [252]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.273032
New York      0.151416
Vermont       0.677043
Florida       3.167433
Oregon       -1.155643
Nevada       -0.051764
California    0.197304
Idaho         1.149709
dtype: float64

In [253]:
data[['Vermont', 'Nevada',  'Idaho']]

Vermont    0.677043
Nevada    -0.051764
Idaho      1.149709
dtype: float64

In [0]:
data[['Vermont', 'Nevada',  'Idaho']] = np.nan

In [255]:
data

Ohio          0.273032
New York      0.151416
Vermont            NaN
Florida       3.167433
Oregon       -1.155643
Nevada             NaN
California    0.197304
Idaho              NaN
dtype: float64

In [256]:
data.groupby(group_key).mean()

East    1.197294
West   -0.479169
dtype: float64

In [0]:
fill_mean = lambda g : g.fillna(g.mean())

In [258]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.273032
New York      0.151416
Vermont       1.197294
Florida       3.167433
Oregon       -1.155643
Nevada       -0.479169
California    0.197304
Idaho        -0.479169
dtype: float64

<b> fillna based on groups

In [0]:
fill_values = {'East' : 0.5 , 
               'West' : -1}

In [0]:
fill_func = lambda g : g.fillna(fill_values[g.name])

In [261]:
data.groupby(group_key).apply(fill_func)

Ohio          0.273032
New York      0.151416
Vermont       0.500000
Florida       3.167433
Oregon       -1.155643
Nevada       -1.000000
California    0.197304
Idaho        -1.000000
dtype: float64

# Example: Random Sampling and Permutation

In [0]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [263]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [264]:
# Drawing 5 cards from deck
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)

7S     7
2H     2
8D     8
4C     4
JC    10
dtype: int64

In [265]:
get_suit = lambda card: card[-1] # last letter is suit
get_suit

In [266]:
deck.groupby(get_suit).apply(draw, n=2)

C  10C    10
   3C      3
D  QD     10
   7D      7
H  2H      2
   6H      6
S  QS     10
   2S      2
dtype: int64

# Example: Group Weighted Average and Correlation

In [267]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

  category      data   weights
0        a -1.887940  0.131309
1        a  0.485960  0.309150
2        a -1.490703  0.433122
3        a  0.405051  0.243464
4        b  1.700951  0.144287
5        b -1.271155  0.322279
6        b  0.998227  0.594152
7        b -1.180904  0.163785

In [268]:
grouped = df.groupby('category')
grouped

In [269]:
get_wavg = lambda g : np.average(g['data'] , weights = g['weights'])
get_wavg

In [270]:
grouped.apply(get_wavg)

category
a   -0.577157
b    0.192276
dtype: float64

In [0]:
close_px = pd.read_csv('https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/stock_px_2.csv' , 
                       parse_dates = True , 
                       index_col = 0)

In [272]:
close_px.head(3)

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01

In [273]:
close_px.describe()

              AAPL         MSFT          XOM          SPX
count  2214.000000  2214.000000  2214.000000  2214.000000
mean    125.516147    23.945452    59.558744  1183.773311
std     107.394693     3.255198    16.725025   180.983466
min       6.560000    14.330000    26.210000   676.530000
25%      37.135000    21.700000    49.492500  1077.060000
50%      91.455000    24.000000    62.970000  1189.260000
75%     185.605000    26.280000    72.510000  1306.057500
max     422.000000    34.070000    87.480000  1565.150000

In [274]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [0]:
spx_corr = lambda x : x.corrwith(x['SPX'])

In [0]:
# percentage change on close_px

In [277]:
rets = close_px.pct_change().dropna()
rets

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
...              ...       ...       ...       ...
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2213 rows x 4 columns]

In [278]:
get_year = lambda x : x.year
get_year

In [279]:
by_year = rets.groupby(get_year)
by_year

In [280]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [0]:
# Annual correlation between aaple and microsoft

In [282]:
by_year.apply(lambda g : g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

# Example: Group-Wise Linear Regression

In [0]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [284]:
by_year.apply(regress , 'AAPL' , ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

# Pivot Tables and Cross-Tabulation

In [285]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [286]:
tips.pivot_table(index = ['day' , 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [287]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [288]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [289]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=False)

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [290]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [291]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True , fill_value = 0)

day            Fri  Sat  Sun  Thur    All
time   smoker
Dinner No        3   45   57     1  106.0
       Yes       9   42   19     0   70.0
Lunch  No        1    0    0    44   45.0
       Yes       6    0    0    17   23.0
All             19   87   76    62  244.0

# Cross-Tabulations: Crosstab

In [0]:
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')

In [293]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [294]:
pd.crosstab(data.Nationality , data.Handedness , margins = True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [295]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

In [0]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS